//=============================================================================
// メニュー画面 [menu.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _MENU_H_
#define _MENU_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MENU_MAX_UI			(7)			// UIの最大数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;
class CUi;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CMenu : public CScene
{
public:
	CMenu();											// コンストラクタ
	~CMenu();											// デストラクタ
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 初期化処理
	void Uninit(void);									// 終了処理
	void Update(void);									// 更新処理
	void Draw(void);									// 描画処理

private:
	void GuideChange(void);								// 説明UIの画像切り替え処理
	static int m_nSelect;								// どのモードを選んでいるか
	static float m_fScroll;								// 背景スクロール用の変数
	CScene2D *m_pScene2D;								// 2Dオブジェクトのポインタ
	CUi *m_apUi[MENU_MAX_UI];							// UIのポインタ
	CUi *m_apGuideUi;									// 説明UIのポインタ
};

#endif	// _MENU_H_