//=============================================================================
// リザルト画面 [result.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define RESULT_MAX_UI			(8)			// UIの最大数
#define RESULT_MAX_PLAYER		(2)			// 最大人数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CUi;
class CBillboard;
class CPlayer;
class CScore;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CResult : public CScene
{
public:
	CResult();											// コンストラクタ
	~CResult();											// デストラクタ
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 初期化処理
	void Uninit(void);									// 終了処理
	void Update(void);									// 更新処理
	void Draw(void);									// 描画処理

private:
	CUi *m_apUi[RESULT_MAX_UI];							// UIのポインタ
	CBillboard *m_pBillboard;							// 2Dオブジェクトのポインタ
	CPlayer *m_pPlayer[MAX_PLAYER_NUM];					// プレイヤーのポインタ
	CScore *m_pScore[RESULT_MAX_PLAYER];				// スコアのポインタ
};

#endif	// _RESULT_H_