//=============================================================================
// サウンドテスト画面 [soundtest.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _SOUNDTEST_H_
#define _SOUNDTEST_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SOUNDTEST_MAX_UI			(4)			// UIの最大数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;
class CUi;
class CNumberSound;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CSoundTest : public CScene
{
public:
	CSoundTest();										// コンストラクタ
	~CSoundTest();										// デストラクタ
	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 初期化処理
	void Uninit(void);									// 終了処理
	void Update(void);									// 更新処理
	void Draw(void);									// 描画処理

private:
	static int m_nSelect;								// どれを選んでいるか
	static float m_fScroll;								// 背景スクロール用の変数
	CScene2D *m_pScene2D;								// 2Dオブジェクトのポインタ
	CUi *m_apUi[SOUNDTEST_MAX_UI];						// UIのポインタ
	CNumberSound *m_pSoundNumber;						// サウンドナンバーのポインタ
};

#endif	// _SOUNDTEST_H_